benchmarks/results/auth-serialization/test-me/final/wrk2-logs/run_1_2605_1148.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/me
  2 threads and 4 connections
  Thread calibration: mean lat.: 2.922ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.111ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.93ms  742.88us   5.90ms   64.09%
    Req/Sec   315.35     86.11   444.00     54.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.86ms
 75.000%    3.52ms
 90.000%    3.93ms
 99.000%    4.57ms
 99.900%    5.16ms
 99.990%    5.82ms
 99.999%    5.90ms
100.000%    5.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.166     0.000000            1         1.00
       1.995     0.100000         1200         1.11
       2.253     0.200000         2399         1.25
       2.427     0.300000         3602         1.43
       2.621     0.400000         4799         1.67
       2.861     0.500000         5999         2.00
       2.997     0.550000         6598         2.22
       3.127     0.600000         7200         2.50
       3.255     0.650000         7796         2.86
       3.387     0.700000         8400         3.33
       3.515     0.750000         8996         4.00
       3.583     0.775000         9298         4.44
       3.647     0.800000         9605         5.00
       3.719     0.825000         9901         5.71
       3.789     0.850000        10205         6.67
       3.855     0.875000        10496         8.00
       3.895     0.887500        10644         8.89
       3.933     0.900000        10796        10.00
       3.971     0.912500        10944        11.43
       4.013     0.925000        11096        13.33
       4.071     0.937500        11248        16.00
       4.099     0.943750        11327        17.78
       4.143     0.950000        11393        20.00
       4.179     0.956250        11470        22.86
       4.219     0.962500        11543        26.67
       4.271     0.968750        11620        32.00
       4.299     0.971875        11660        35.56
       4.327     0.975000        11694        40.00
       4.367     0.978125        11732        45.71
       4.411     0.981250        11768        53.33
       4.455     0.984375        11806        64.00
       4.483     0.985938        11824        71.11
       4.527     0.987500        11844        80.00
       4.547     0.989062        11863        91.43
       4.583     0.990625        11880       106.67
       4.639     0.992188        11899       128.00
       4.667     0.992969        11911       142.22
       4.679     0.993750        11918       160.00
       4.727     0.994531        11927       182.86
       4.783     0.995313        11938       213.33
       4.875     0.996094        11947       256.00
       4.883     0.996484        11950       284.44
       4.911     0.996875        11955       320.00
       4.967     0.997266        11960       365.71
       5.007     0.997656        11964       426.67
       5.047     0.998047        11970       512.00
       5.067     0.998242        11971       568.89
       5.099     0.998437        11974       640.00
       5.115     0.998633        11976       731.43
       5.127     0.998828        11978       853.33
       5.195     0.999023        11981      1024.00
       5.219     0.999121        11983      1137.78
       5.219     0.999219        11983      1280.00
       5.339     0.999316        11984      1462.86
       5.355     0.999414        11985      1706.67
       5.447     0.999512        11987      2048.00
       5.447     0.999561        11987      2275.56
       5.507     0.999609        11988      2560.00
       5.507     0.999658        11988      2925.71
       5.543     0.999707        11989      3413.33
       5.583     0.999756        11990      4096.00
       5.583     0.999780        11990      4551.11
       5.583     0.999805        11990      5120.00
       5.583     0.999829        11990      5851.43
       5.819     0.999854        11991      6826.67
       5.819     0.999878        11991      8192.00
       5.819     0.999890        11991      9102.22
       5.819     0.999902        11991     10240.00
       5.819     0.999915        11991     11702.86
       5.899     0.999927        11992     13653.33
       5.899     1.000000        11992          inf
#[Mean    =        2.928, StdDeviation   =        0.743]
#[Max     =        5.896, Total count    =        11992]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18000 requests in 30.00s, 4.77MB read
Requests/sec:    599.97
Transfer/sec:    162.88KB