benchmarks/results/auth-serialization/test-me/final/wrk2-logs/run_2_2605_1149.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/me
  2 threads and 4 connections
  Thread calibration: mean lat.: 2.495ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.994ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.45ms  506.63us   4.98ms   67.65%
    Req/Sec   314.34     70.28   444.00     50.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.40ms
 75.000%    2.78ms
 90.000%    3.13ms
 99.000%    3.70ms
 99.900%    4.62ms
 99.990%    4.97ms
 99.999%    4.98ms
100.000%    4.98ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.185     0.000000            1         1.00
       1.833     0.100000         1205         1.11
       2.008     0.200000         2399         1.25
       2.151     0.300000         3599         1.43
       2.275     0.400000         4799         1.67
       2.401     0.500000         6010         2.00
       2.469     0.550000         6607         2.22
       2.545     0.600000         7197         2.50
       2.619     0.650000         7811         2.86
       2.689     0.700000         8395         3.33
       2.779     0.750000         9000         4.00
       2.821     0.775000         9300         4.44
       2.875     0.800000         9598         5.00
       2.931     0.825000         9901         5.71
       2.995     0.850000        10203         6.67
       3.063     0.875000        10503         8.00
       3.097     0.887500        10644         8.89
       3.129     0.900000        10796        10.00
       3.175     0.912500        10948        11.43
       3.221     0.925000        11098        13.33
       3.255     0.937500        11246        16.00
       3.279     0.943750        11319        17.78
       3.299     0.950000        11396        20.00
       3.331     0.956250        11472        22.86
       3.367     0.962500        11544        26.67
       3.419     0.968750        11619        32.00
       3.447     0.971875        11655        35.56
       3.477     0.975000        11697        40.00
       3.505     0.978125        11730        45.71
       3.561     0.981250        11771        53.33
       3.601     0.984375        11805        64.00
       3.627     0.985938        11825        71.11
       3.651     0.987500        11843        80.00
       3.675     0.989062        11861        91.43
       3.709     0.990625        11880       106.67
       3.749     0.992188        11899       128.00
       3.811     0.992969        11908       142.22
       3.833     0.993750        11918       160.00
       3.911     0.994531        11927       182.86
       3.951     0.995313        11936       213.33
       4.103     0.996094        11946       256.00
       4.171     0.996484        11950       284.44
       4.295     0.996875        11955       320.00
       4.351     0.997266        11960       365.71
       4.431     0.997656        11964       426.67
       4.507     0.998047        11970       512.00
       4.539     0.998242        11971       568.89
       4.571     0.998437        11974       640.00
       4.587     0.998633        11976       731.43
       4.615     0.998828        11979       853.33
       4.695     0.999023        11981      1024.00
       4.703     0.999121        11982      1137.78
       4.751     0.999219        11983      1280.00
       4.755     0.999316        11984      1462.86
       4.783     0.999414        11985      1706.67
       4.807     0.999512        11987      2048.00
       4.807     0.999561        11987      2275.56
       4.843     0.999609        11988      2560.00
       4.843     0.999658        11988      2925.71
       4.875     0.999707        11989      3413.33
       4.955     0.999756        11990      4096.00
       4.955     0.999780        11990      4551.11
       4.955     0.999805        11990      5120.00
       4.955     0.999829        11990      5851.43
       4.971     0.999854        11991      6826.67
       4.971     0.999878        11991      8192.00
       4.971     0.999890        11991      9102.22
       4.971     0.999902        11991     10240.00
       4.971     0.999915        11991     11702.86
       4.979     0.999927        11992     13653.33
       4.979     1.000000        11992          inf
#[Mean    =        2.448, StdDeviation   =        0.507]
#[Max     =        4.976, Total count    =        11992]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18000 requests in 30.00s, 4.77MB read
Requests/sec:    599.97
Transfer/sec:    162.88KB