benchmarks/results/auth-serialization/test-me/final/wrk2-logs/run_3_2605_1150.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/me
  2 threads and 4 connections
  Thread calibration: mean lat.: 2.373ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.297ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.35ms  513.71us   4.91ms   70.27%
    Req/Sec   315.98     63.91   444.00     62.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.30ms
 75.000%    2.65ms
 90.000%    3.01ms
 99.000%    3.90ms
 99.900%    4.49ms
 99.990%    4.81ms
 99.999%    4.91ms
100.000%    4.91ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.254     0.000000            1         1.00
       1.726     0.100000         1204         1.11
       1.919     0.200000         2403         1.25
       2.065     0.300000         3612         1.43
       2.185     0.400000         4809         1.67
       2.299     0.500000         6016         2.00
       2.361     0.550000         6617         2.22
       2.421     0.600000         7210         2.50
       2.491     0.650000         7809         2.86
       2.571     0.700000         8402         3.33
       2.653     0.750000         8997         4.00
       2.703     0.775000         9308         4.44
       2.749     0.800000         9599         5.00
       2.805     0.825000         9903         5.71
       2.861     0.850000        10204         6.67
       2.935     0.875000        10498         8.00
       2.973     0.887500        10651         8.89
       3.011     0.900000        10805        10.00
       3.049     0.912500        10945        11.43
       3.103     0.925000        11094        13.33
       3.157     0.937500        11248        16.00
       3.191     0.943750        11320        17.78
       3.223     0.950000        11394        20.00
       3.271     0.956250        11470        22.86
       3.329     0.962500        11544        26.67
       3.423     0.968750        11619        32.00
       3.479     0.971875        11657        35.56
       3.543     0.975000        11694        40.00
       3.599     0.978125        11731        45.71
       3.679     0.981250        11769        53.33
       3.751     0.984375        11807        64.00
       3.793     0.985938        11825        71.11
       3.847     0.987500        11846        80.00
       3.869     0.989062        11863        91.43
       3.919     0.990625        11883       106.67
       3.987     0.992188        11900       128.00
       4.023     0.992969        11909       142.22
       4.051     0.993750        11920       160.00
       4.077     0.994531        11929       182.86
       4.115     0.995313        11937       213.33
       4.175     0.996094        11948       256.00
       4.195     0.996484        11951       284.44
       4.223     0.996875        11956       320.00
       4.267     0.997266        11961       365.71
       4.279     0.997656        11965       426.67
       4.327     0.998047        11970       512.00
       4.363     0.998242        11972       568.89
       4.407     0.998437        11975       640.00
       4.423     0.998633        11977       731.43
       4.435     0.998828        11979       853.33
       4.499     0.999023        11982      1024.00
       4.511     0.999121        11983      1137.78
       4.515     0.999219        11984      1280.00
       4.527     0.999316        11985      1462.86
       4.555     0.999414        11986      1706.67
       4.651     0.999512        11988      2048.00
       4.651     0.999561        11988      2275.56
       4.663     0.999609        11989      2560.00
       4.663     0.999658        11989      2925.71
       4.743     0.999707        11990      3413.33
       4.771     0.999756        11991      4096.00
       4.771     0.999780        11991      4551.11
       4.771     0.999805        11991      5120.00
       4.771     0.999829        11991      5851.43
       4.807     0.999854        11992      6826.67
       4.807     0.999878        11992      8192.00
       4.807     0.999890        11992      9102.22
       4.807     0.999902        11992     10240.00
       4.807     0.999915        11992     11702.86
       4.915     0.999927        11993     13653.33
       4.915     1.000000        11993          inf
#[Mean    =        2.350, StdDeviation   =        0.514]
#[Max     =        4.912, Total count    =        11993]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18001 requests in 30.00s, 4.77MB read
Requests/sec:    599.99
Transfer/sec:    162.89KB